daily-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Daily notes</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<h1 class="title">Daily notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Day 1</a>
<ul>
<li><a href="#sec-1-1">What is AI?</a></li>
<li><a href="#sec-1-2">Examples of AI</a></li>
</ul>
</li>
<li><a href="#sec-2">Day 2</a>
<ul>
<li><a href="#sec-2-1">How do we test for AI?</a></li>
<li><a href="#sec-2-2">The Turing Test</a>
<ul>
<li><a href="#sec-2-2-1">The imitation game</a></li>
<li><a href="#sec-2-2-2">Replace the man with a machine</a></li>
<li><a href="#sec-2-2-3">What's "success"?</a></li>
</ul>
</li>
<li><a href="#sec-2-3">Dennett's weaker versions</a></li>
<li><a href="#sec-2-4">Langley's challenges</a></li>
</ul>
</li>
<li><a href="#sec-3">Day 3</a>
<ul>
<li><a href="#sec-3-1">Python</a></li>
<li><a href="#sec-3-2">Search</a>
<ul>
<li><a href="#sec-3-2-1">Example: Wolves &amp; chicks</a></li>
</ul>
</li>
<li><a href="#sec-3-3">Basic BFS algorithm:</a></li>
<li><a href="#sec-3-4">Basic DFS algorithm:</a></li>
</ul>
</li>
<li><a href="#sec-4">Day 4</a>
<ul>
<li><a href="#sec-4-1">Informed search</a></li>
</ul>
</li>
<li><a href="#sec-5">Day 5</a>
<ul>
<li><a href="#sec-5-1">Pacman</a></li>
<li><a href="#sec-5-2">Heuristics for 8-puzzle</a></li>
<li><a href="#sec-5-3">Heuristics for Goodale routing</a></li>
<li><a href="#sec-5-4">Hill-climbing</a></li>
<li><a href="#sec-5-5">Best-first search</a></li>
<li><a href="#sec-5-6">Again with the heuristics</a>
<ul>
<li><a href="#sec-5-6-1">Goodale</a></li>
</ul>
</li>
<li><a href="#sec-5-7">A*</a></li>
<li><a href="#sec-5-8">Websites</a></li>
</ul>
</li>
<li><a href="#sec-6">Day 6</a>
<ul>
<li><a href="#sec-6-1">A*</a></li>
<li><a href="#sec-6-2">Heaps</a></li>
<li><a href="#sec-6-3">Cost functions (path-cost + heuristic)</a>
<ul>
<li><a href="#sec-6-3-1">What's the number associated with a state?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-7">Day 8</a>
<ul>
<li><a href="#sec-7-1">Zero-sum games</a></li>
<li><a href="#sec-7-2">Tic-tac-toe</a></li>
</ul>
</li>
<li><a href="#sec-8">Day 9</a>
<ul>
<li><a href="#sec-8-1">Connect-four code with depth-limited minimax</a></li>
</ul>
</li>
<li><a href="#sec-9">Day 10</a>
<ul>
<li><a href="#sec-9-1">Knowledge representation</a></li>
<li><a href="#sec-9-2">Boolean logic</a></li>
<li><a href="#sec-9-3">Propositional logic</a>
<ul>
<li><a href="#sec-9-3-1">Rules of inference</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-10">Day 12</a>
<ul>
<li><a href="#sec-10-1">First-order logic</a></li>
<li><a href="#sec-10-2">Prolog</a></li>
</ul>
</li>
<li><a href="#sec-11">Day 13</a>
<ul>
<li><a href="#sec-11-1">Prolog</a></li>
</ul>
</li>
<li><a href="#sec-12">Day 14</a>
<ul>
<li><a href="#sec-12-1">Prolog unification</a></li>
</ul>
</li>
<li><a href="#sec-13">Day 22</a>
<ul>
<li><a href="#sec-13-1">Planning</a>
<ul>
<li><a href="#sec-13-1-1">Features of a planning problem</a></li>
<li><a href="#sec-13-1-2">Typical assumptions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-14">Day 22</a>
<ul>
<li><a href="#sec-14-1">Boids</a></li>
<li><a href="#sec-14-2">Altruism model</a></li>
<li><a href="#sec-14-3">Termite collecting</a></li>
<li><a href="#sec-14-4">Principles of designing multi-agent systems</a></li>
</ul>
</li>
<li><a href="#sec-15">Day 23</a>
<ul>
<li><a href="#sec-15-1">HCOMP 2014</a></li>
<li><a href="#sec-15-2">In the news</a></li>
<li><a href="#sec-15-3">Ant sorting</a></li>
<li><a href="#sec-15-4">Prisoner's dilemma</a></li>
</ul>
</li>
<li><a href="#sec-16">Day 24</a>
<ul>
<li><a href="#sec-16-1">Machine learning</a></li>
<li><a href="#sec-16-2">K-means clustering</a></li>
</ul>
</li>
<li><a href="#sec-17">Day 25</a>
<ul>
<li><a href="#sec-17-1">Classification evaluation</a></li>
</ul>
</li>
<li><a href="#sec-18">Day 26</a>
<ul>
<li><a href="#sec-18-1">Chinese room argument (Searle)</a>
<ul>
<li><a href="#sec-18-1-1">Weak AI</a></li>
<li><a href="#sec-18-1-2">Strong AI</a></li>
<li><a href="#sec-18-1-3">Schank's scripts</a>
<ul>
<li><a href="#sec-18-1-3-1">Scripts</a></li>
</ul>
</li>
<li><a href="#sec-18-1-4">Searle's counterargument</a>
<ul>
<li><a href="#sec-18-1-4-1">The setup</a></li>
<li><a href="#sec-18-1-4-2">What if I told you that:</a></li>
<li><a href="#sec-18-1-4-3">Questions</a></li>
<li><a href="#sec-18-1-4-4">Possible replies</a></li>
</ul>
</li>
<li><a href="#sec-18-1-5">The point</a></li>
</ul>
</li>
<li><a href="#sec-18-2">Robot ethics</a>
<ul>
<li><a href="#sec-18-2-1">Asimov's three laws</a>
<ul>
<li><a href="#sec-18-2-1-1">Issues with Asimov's three laws</a></li>
</ul>
</li>
<li><a href="#sec-18-2-2">Machine ethics (computable ethics)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Day 1</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">What is AI?</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>[act/think] [rationally/humanly]

<ul class="org-ul">
<li>act rationally: do the correct things in
the world
</li>

<li>act humanly: do the things the human would
do in the world
</li>

<li>think rationally: use the best algorithms
to get the correct results
</li>

<li>think humanly: the AI system has internal
representations and algorithms like human
cognition
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Examples of AI</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>system that designs video games
</li>
<li>IBM's Watson: won Jeopardy!, healthcare
</li>
<li>Siri
</li>
<li>IBM Deep Blue, beat Kasparov 1997, "Game Over",
used specialized chips that play chess
</li>
<li>Google's autonomous vehicles
</li>
<li>Google bought Boston Dynamics
</li>
<li>Amazon Air (drones)
</li>
<li>Video game AI
</li>
<li>robots that learn new languages like toddlers do
</li>
<li>drone fighting drones
</li>
<li>military drones
</li>
<li>Google Glass
</li>
<li>Google Search
</li>
<li>Google Ads
</li>
<li>Google Now
</li>
<li>Google Then
</li>
<li>Google Future
</li>
<li>Machine Learning, Data Mining
</li>
<li>Fraud detection
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Day 2</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">How do we test for AI?</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>put it in a human situation and see if it comes to the same
decisions as a human
<ul class="org-ul">
<li>maybe just report its decisions, not act on them
</li>
<li>maybe also physically does the same things (if it has arms
and legs, etc.)
</li>
</ul>
</li>
<li>give it human tests for intelligence, IQ tests, SATs, LSAT,
behavioral tests
</li>
<li>Voigt-Kampff test
</li>
<li>Turing Test
</li>
<li>interact with people who don't know it's a robot
</li>
<li>mock tests of certain scenarios
</li>
<li>see if you can tell the difference between human and machine
</li>
<li>human-robot chat
</li>
<li>see if it has self-preservation tendencies
</li>
<li>ask how it feels, emotions
</li>
<li>listen to a song with it, then ask it how the song makes it feel
</li>
<li>put it in a paradoxical situation, ethical conundrum
<ul class="org-ul">
<li>save your dog or the child
</li>
</ul>
</li>
<li>ask any question about any topic to see how it responds
</li>
<li>job interview
</li>
<li>meet the president, or the Queen
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">The Turing Test</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">The imitation game</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>A man (A), a woman (B), and a judge (C)
</li>
<li>The judge cannot see A or B (or hear them)
</li>
<li>The judge must determine who is the woman
</li>
<li>The man (A) wants to convince the judge that he is a woman
<ul class="org-ul">
<li>AND, (harder) that the woman is NOT a woman
</li>
</ul>
</li>
<li>And the woman (B) is trying to convince the judge that she is
the woman
</li>
<li>If the man succeeds, then we can say he is intelligent
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">Replace the man with a machine</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>now the machine (A) is trying to convince the judge that it
is the woman
<ul class="org-ul">
<li>woman still trying to say she is the woman
</li>
</ul>
</li>

<li>we often think of it as the machine trying to convince the judge
that it is the human
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3">What's "success"?</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>How often (%) must the man convince the judge that he is the
woman to be considered a good woman imitator?
<ul class="org-ul">
<li>about 25%
</li>
<li>Turing said 30% would be good enough
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Dennett's weaker versions</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Chess (beating Kasparov)
<ul class="org-ul">
<li>doesn't cover range of intelligence
</li>
<li>isolatable skill
</li>
</ul>
</li>
<li>Solves the Arab-Israeli conflict
<ul class="org-ul">
<li>harder than the TT
</li>
<li>unrepeatable
</li>
<li>slow
</li>
<li>not clear what is considered winning
</li>
</ul>
</li>
<li>Steals the crown jewels
<ul class="org-ul">
<li>might be able to find security vulnerabilities
</li>
<li>luck
</li>
<li>ethically dubious
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Langley's challenges</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Synthetic entertainer
<ul class="org-ul">
<li>American AIdoll
</li>
</ul>
</li>
<li>Synthetic attorney
</li>
<li>Synthetic politician
</li>
</ul>
</div>
</div>
</div>
