daily-notes.org
** Python

This is the code we played with. Try it out yourself at the "REPL"
(just run =python= from your console).

#+BEGIN_SRC python
x = 5
print x
while x > 0:
    print x
    x -= 1

mylist = ["bob", "jane", "alice"]
print mylist

for name in mylist:
    print name

print enumerate(mylist)
print list(enumerate(mylist))
for (i, name) in enumerate(mylist):
    print "index is", i, "and name is", name

mylist2 = [(1, 2, 3), (4, 5, 6)]
for (x, y, z) in mylist2:
    print x, y, z

mystack = []
mystack.append('A')
print mystack
mystack.append('B')
print mystack
print mystack.pop()
print mystack

from collections import deque
myqueue = deque()
print myqueue
myqueue.append('A')
myqueue.append('B')
print myqueue
print myqueue.popleft()
print myqueue
print myqueue.pop()
print myqueue

mylist = ["bob", "jane", "alice"]
print mylist[0]
print mylist[0:1]
print mylist[0:2]
print mylist[0:3]
print mylist[1:3]
print mylist[1:2]
print mylist[1:-1]
print mylist[1:-2]
print mylist[0:-2]
print mylist[-1]
print mylist[-2]
print mylist[-2:0]

# This page describes "list splicing":
# http://stackoverflow.com/questions/509211/pythons-slice-notation

# reverse a string or list:
mystring = "mystring"
print mystring[::-1]

def myfunc(x):
    return x+1

print myfunc(52)

def myfunc(x):
    return (x, x+1)

print myfunc(52)

def myfunc(x=5):  # default value for x
    print x

myfunc()
myfunc(10)

class MyClass:
    def myclassfunc(self, x):
        print x

myobj = MyClass()
myobj.myclassfunc(10)

class MyClass:
    # the constructor
    def __init__(self):
        self.timesExecuted = 0
    def myclassfunc(self):
        self.timesExecuted += 1
        print self.timesExecuted

myobj = MyClass()
myobj.myclassfunc()  # prints 1
myobj.myclassfunc()  # prints 2
myobj.myclassfunc()  # prints 3
#+END_SRC

** Search

*** Example: Wolves & chicks

    - Take three chicks and three wolves across the river
    - If there is a wolf on one side, it will eat the chicks
    - Boat only holds two animals

    - Initial state :: Three wolves and three chicks on same side

    - Possible actions :: Put a chick on the boat, put a wolf
         on the boat, move the boat across

    - Transition model :: A function from state to [list of states]
         and for this problem, the list of states are those
         that do not kill the chicks

    - Goal criteria :: All on other side

    - Path cost :: A function from list of states/actions to
         some kind of cost; 
         sometimes you want the least-cost solution



** Basic BFS algorithm:

#+BEGIN_SRC
   - openset = [start] # places I know about, but haven't been to
   - closedset = [] # places I have been to
   - while len(openset) > 0:  # i.e., openset not empty
     - state = openset.popleft() # I want a queue/deque
     - closedset.append(state)
     - if state == goal:
       - done
     - else:
       - for next_state in possible_moves(state):
         - if next_state not in closedset:
             - openset.append(next_state)
#+END_SRC

** Basic DFS algorithm:

#+BEGIN_SRC
   - openset = [start] # places I know about, but haven't been to
   - closedset = [] # places I have been to
   - while len(openset) > 0:  # i.e., openset not empty
     - state = openset.pop() # I want a stack  <------- ONLY DIFFERENCE FROM BFS
     - closedset.append(state)
     - if state == goal:
       - done
     - else:
       - for next_state in possible_moves(state):
         - if next_state not in closedset:
             - openset.append(next_state)
#+END_SRC


* Day 4

