daily-notes.html


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Day 3</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Python</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This is the code we played with. Try it out yourself at the "REPL"
(just run <code>python</code> from your console).
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #000000; background-color: #ffffff;">x</span> = 5
<span style="color: #004dd0; background-color: #ffffff;">print</span> x
<span style="color: #004dd0; background-color: #ffffff;">while</span> x &gt; 0:
    <span style="color: #004dd0; background-color: #ffffff;">print</span> x
    <span style="color: #000000; background-color: #ffffff;">x</span> -= 1

<span style="color: #000000; background-color: #ffffff;">mylist</span> = [<span style="color: #670088; background-color: #ffffff; font-style: italic;">"bob"</span>, <span style="color: #670088; background-color: #ffffff; font-style: italic;">"jane"</span>, <span style="color: #670088; background-color: #ffffff; font-style: italic;">"alice"</span>]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist

<span style="color: #004dd0; background-color: #ffffff;">for</span> name <span style="color: #004dd0; background-color: #ffffff;">in</span> mylist:
    <span style="color: #004dd0; background-color: #ffffff;">print</span> name

<span style="color: #004dd0; background-color: #ffffff;">print</span> <span style="color: #000000; background-color: #ffffff; font-weight: bold;">enumerate</span>(mylist)
<span style="color: #004dd0; background-color: #ffffff;">print</span> <span style="color: #000000; background-color: #ffffff; font-weight: bold;">list</span>(<span style="color: #000000; background-color: #ffffff; font-weight: bold;">enumerate</span>(mylist))
<span style="color: #004dd0; background-color: #ffffff;">for</span> (i, name) <span style="color: #004dd0; background-color: #ffffff;">in</span> <span style="color: #000000; background-color: #ffffff; font-weight: bold;">enumerate</span>(mylist):
    <span style="color: #004dd0; background-color: #ffffff;">print</span> <span style="color: #670088; background-color: #ffffff; font-style: italic;">"index is"</span>, i, <span style="color: #670088; background-color: #ffffff; font-style: italic;">"and name is"</span>, name

<span style="color: #000000; background-color: #ffffff;">mylist2</span> = [(1, 2, 3), (4, 5, 6)]
<span style="color: #004dd0; background-color: #ffffff;">for</span> (x, y, z) <span style="color: #004dd0; background-color: #ffffff;">in</span> mylist2:
    <span style="color: #004dd0; background-color: #ffffff;">print</span> x, y, z

<span style="color: #000000; background-color: #ffffff;">mystack</span> = []
mystack.append(<span style="color: #670088; background-color: #ffffff; font-style: italic;">'A'</span>)
<span style="color: #004dd0; background-color: #ffffff;">print</span> mystack
mystack.append(<span style="color: #670088; background-color: #ffffff; font-style: italic;">'B'</span>)
<span style="color: #004dd0; background-color: #ffffff;">print</span> mystack
<span style="color: #004dd0; background-color: #ffffff;">print</span> mystack.pop()
<span style="color: #004dd0; background-color: #ffffff;">print</span> mystack

<span style="color: #004dd0; background-color: #ffffff;">from</span> collections <span style="color: #004dd0; background-color: #ffffff;">import</span> deque
<span style="color: #000000; background-color: #ffffff;">myqueue</span> = deque()
<span style="color: #004dd0; background-color: #ffffff;">print</span> myqueue
myqueue.append(<span style="color: #670088; background-color: #ffffff; font-style: italic;">'A'</span>)
myqueue.append(<span style="color: #670088; background-color: #ffffff; font-style: italic;">'B'</span>)
<span style="color: #004dd0; background-color: #ffffff;">print</span> myqueue
<span style="color: #004dd0; background-color: #ffffff;">print</span> myqueue.popleft()
<span style="color: #004dd0; background-color: #ffffff;">print</span> myqueue
<span style="color: #004dd0; background-color: #ffffff;">print</span> myqueue.pop()
<span style="color: #004dd0; background-color: #ffffff;">print</span> myqueue

<span style="color: #000000; background-color: #ffffff;">mylist</span> = [<span style="color: #670088; background-color: #ffffff; font-style: italic;">"bob"</span>, <span style="color: #670088; background-color: #ffffff; font-style: italic;">"jane"</span>, <span style="color: #670088; background-color: #ffffff; font-style: italic;">"alice"</span>]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist[0]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist[0:1]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist[0:2]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist[0:3]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist[1:3]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist[1:2]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist[1:-1]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist[1:-2]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist[0:-2]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist[-1]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist[-2]
<span style="color: #004dd0; background-color: #ffffff;">print</span> mylist[-2:0]

<span style="color: #00005d; background-color: #ffffff; font-style: italic;"># </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">This page describes "list splicing":</span>
<span style="color: #00005d; background-color: #ffffff; font-style: italic;"># </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">http://stackoverflow.com/questions/509211/pythons-slice-notation</span>

<span style="color: #00005d; background-color: #ffffff; font-style: italic;"># </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">reverse a string or list:</span>
<span style="color: #000000; background-color: #ffffff;">mystring</span> = <span style="color: #670088; background-color: #ffffff; font-style: italic;">"mystring"</span>
<span style="color: #004dd0; background-color: #ffffff;">print</span> mystring[::-1]

<span style="color: #004dd0; background-color: #ffffff;">def</span> <span style="color: #000000; background-color: #ffffff; font-weight: bold;">myfunc</span>(x):
    <span style="color: #004dd0; background-color: #ffffff;">return</span> x+1

<span style="color: #004dd0; background-color: #ffffff;">print</span> myfunc(52)

<span style="color: #004dd0; background-color: #ffffff;">def</span> <span style="color: #000000; background-color: #ffffff; font-weight: bold;">myfunc</span>(x):
    <span style="color: #004dd0; background-color: #ffffff;">return</span> (x, x+1)

<span style="color: #004dd0; background-color: #ffffff;">print</span> myfunc(52)

<span style="color: #004dd0; background-color: #ffffff;">def</span> <span style="color: #000000; background-color: #ffffff; font-weight: bold;">myfunc</span>(x=5):  <span style="color: #00005d; background-color: #ffffff; font-style: italic;"># </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">default value for x</span>
    <span style="color: #004dd0; background-color: #ffffff;">print</span> x

myfunc()
myfunc(10)

<span style="color: #004dd0; background-color: #ffffff;">class</span> <span style="color: #004dd0; background-color: #ffffff;">MyClass</span>:
    <span style="color: #004dd0; background-color: #ffffff;">def</span> <span style="color: #000000; background-color: #ffffff; font-weight: bold;">myclassfunc</span>(<span style="color: #004dd0; background-color: #ffffff;">self</span>, x):
        <span style="color: #004dd0; background-color: #ffffff;">print</span> x

<span style="color: #000000; background-color: #ffffff;">myobj</span> = MyClass()
myobj.myclassfunc(10)

<span style="color: #004dd0; background-color: #ffffff;">class</span> <span style="color: #004dd0; background-color: #ffffff;">MyClass</span>:
    <span style="color: #00005d; background-color: #ffffff; font-style: italic;"># </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">the constructor</span>
    <span style="color: #004dd0; background-color: #ffffff;">def</span> <span style="color: #000000; background-color: #ffffff; font-weight: bold;">__init__</span>(<span style="color: #004dd0; background-color: #ffffff;">self</span>):
        <span style="color: #004dd0; background-color: #ffffff;">self</span>.timesExecuted = 0
    <span style="color: #004dd0; background-color: #ffffff;">def</span> <span style="color: #000000; background-color: #ffffff; font-weight: bold;">myclassfunc</span>(<span style="color: #004dd0; background-color: #ffffff;">self</span>):
        <span style="color: #004dd0; background-color: #ffffff;">self</span>.timesExecuted += 1
        <span style="color: #004dd0; background-color: #ffffff;">print</span> <span style="color: #004dd0; background-color: #ffffff;">self</span>.timesExecuted

<span style="color: #000000; background-color: #ffffff;">myobj</span> = MyClass()
myobj.myclassfunc()  <span style="color: #00005d; background-color: #ffffff; font-style: italic;"># </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">prints 1</span>
myobj.myclassfunc()  <span style="color: #00005d; background-color: #ffffff; font-style: italic;"># </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">prints 2</span>
myobj.myclassfunc()  <span style="color: #00005d; background-color: #ffffff; font-style: italic;"># </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">prints 3</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Search</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1">Example: Wolves &amp; chicks</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>Take three chicks and three wolves across the river
</li>
<li>If there is a wolf on one side, it will eat the chicks
</li>
<li>Boat only holds two animals
</li>

<li id="Initial state">Three wolves and three chicks on same side
</li>

<li id="Possible actions">Put a chick on the boat, put a wolf
on the boat, move the boat across
</li>

<li id="Transition model">A function from state to [list of states]
and for this problem, the list of states are those
that do not kill the chicks
</li>

<li id="Goal criteria">All on other side
</li>

<li id="Path cost">A function from list of states/actions to
some kind of cost; 
sometimes you want the least-cost solution
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Basic BFS algorithm:</h3>
<div class="outline-text-3" id="text-3-3">
<pre class="example">
- openset = [start] # places I know about, but haven't been to
- closedset = [] # places I have been to
- while len(openset) &gt; 0:  # i.e., openset not empty
  - state = openset.popleft() # I want a queue/deque
  - closedset.append(state)
  - if state == goal:
    - done
  - else:
    - for next_state in possible_moves(state):
      - if next_state not in closedset:
          - openset.append(next_state)
</pre>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">Basic DFS algorithm:</h3>
<div class="outline-text-3" id="text-3-4">
<pre class="example">
- openset = [start] # places I know about, but haven't been to
- closedset = [] # places I have been to
- while len(openset) &gt; 0:  # i.e., openset not empty
  - state = openset.pop() # I want a stack  &lt;------- ONLY DIFFERENCE FROM BFS
  - closedset.append(state)
  - if state == goal:
    - done
  - else:
    - for next_state in possible_moves(state):
      - if next_state not in closedset:
          - openset.append(next_state)
</pre>
</div>
</div>
</div>
