daily-notes.org
** Zero-sum games
   - A game where, in the end, all the players' utilities add up to zero
   - Examples:
     - Chess
     - Tug-o-war
     - Poker
     - Trading card game competitions
     - Rock-paper-scissors-lizard-spock
     - Go
     - Tic-tac-toe
     - Checkers
   - Non-examples:
     - Scrabble
     - FPS with co-op
     - Soccer, football, baseball
** Tic-tac-toe
   - Initial state: blank board
   - Possible actions: put an x, put an o
   - Transition model: how a board changes after putting an x/o
   - Players: x and o
   - Terminal tests: three in a row for either x/o or a full board (tie)
   - Utility function (always for x):
     - suppose x has three in a row: 1
     - suppose o has three in a row: -1
     - suppose there is a tie: 0

* Day 9

