daily-notes.html

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Day 8</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">Zero-sum games</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>A game where, in the end, all the players' utilities add up to zero
</li>
<li>Examples:
<ul class="org-ul">
<li>Chess
</li>
<li>Tug-o-war
</li>
<li>Poker
</li>
<li>Trading card game competitions
</li>
<li>Rock-paper-scissors-lizard-spock
</li>
<li>Go
</li>
<li>Tic-tac-toe
</li>
<li>Checkers
</li>
</ul>
</li>
<li>Non-examples:
<ul class="org-ul">
<li>Scrabble
</li>
<li>FPS with co-op
</li>
<li>Soccer, football, baseball
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2">Tic-tac-toe</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>Initial state: blank board
</li>
<li>Possible actions: put an x, put an o
</li>
<li>Transition model: how a board changes after putting an x/o
</li>
<li>Players: x and o
</li>
<li>Terminal tests: three in a row for either x/o or a full board (tie)
</li>
<li>Utility function (always for x):
<ul class="org-ul">
<li>suppose x has three in a row: 1
</li>
<li>suppose o has three in a row: -1
</li>
<li>suppose there is a tie: 0
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
