daily-notes.org
* Day 14

** Prolog unification

   - "unify" a query or goal with something from the source file

     - ~female(X)~ needs to be unified with something in the file

       - ~female(pam)~ looks like it might work.

       - just make ~X = pam~, now they are equivalent

     - ~parent(X, Y)~ unifies with ~parent(bob, ann)~ if ~X=bob~ and ~Y=ann~

     - ~family(Id, person(FirstName, _, _, _, _), _, _)~
       would unify with the first family fact if ~Id=10392~ and
       ~FirstName=tom~

* Day 22

** Planning

- Still a search problem

- Purpose: generate a list of actions that take you from starting
  state to goal state

- Consider:

  - 10 airports
  - 50 planes
  - 200 pieces of cargo
  - All cargo starts at SFO, needs to be at JFK
  - Planes have infinite capacity
  - Actions:
    - load cargo into plane: ~load(p, c)~
    - fly to airport: ~fly(p, a1, a2)~
    - unload cargo: ~unload(p, c)~
  - 50*200*9*50 = 4.5million possible actions at the start

- Solution:
  - represent states as partial configurations of the world
  - search backwards from the goal

- literal :: a singular fact with no fluents, e.g., ~on(monkey, floor)~;
             could have negation: ~not(on(monkey, floor))~

*** Features of a planning problem

  - Initial state :: a conjunction of positive literals (no fluents),
                     e.g., ~on(monkey, floor), at(monkey, 5, 2),
                     on(box, floor), at(box, 3, 0), on(bananas, box)~

  - Actions :: each action has a name, relevant variables (fluents),
               preconditions, effects
               - preconditions can refer to the variables (fluents)
               - effects have positive and negative parts
                 - also called add-lists and delete-lists
                 - these can refer to the variables (fluents)
               - here is an example action:
#+BEGIN_EXAMPLE
action: climb(A, X)
  preconditions: on(A, floor), near(A, X)
  effects:
    add: on(A, X)
    delete: on(A, floor)
#+END_EXAMPLE

  - Goal state criteria :: conjunction of literals, no fluents, can
       have positive and negative literals
       - e.g., ~not(on(monkey, floor)), has(monkey, bananas), ...~


*** Typical assumptions

- atomic time (every action is indivisible)
- no concurrent actions
- deterministic actions
- agent is the sole source of change (frame problem)
- agent is omniscient
- closed world assumption

* Day 22

** Boids

- "birds" -- flocking behavior
- each boid has these rules:
  - cohesion: try to approach other boids
  - separation: try to keep a minimum distance
  - imitation: try to move the same way as other boids
** Altruism model
- each patch's calculation:
  - if patch is altruistic:
    - F = 1 + (# of altruists nearby / 5) * benefit-from-altruism -
      cost-of-altruism
  - if patch is selfish:
    - F = 1 + (# of altruists nearby / 5) * benefit-from-altruism
- higher harshness: reduces the chance of a patch turning either
  altruistic or selfish. Limits population growth.
** Termite collecting
- predesignated collection spot:
  - check: is all sand in the pile?
    - if not, do I have sand?
      - if yes, take it to pile, drop off
      - else, pick up sand not in pile, then start over
- use flocking behavior to group together,
  - if encounter sand, pick up along the way,
  - drop off after flocking behavior is terminated
    - (all sand should be in nearly same spot)
- what actually happens:
  - each termite wanders randomly
  - if it bumps into sand and has none in its mouth, it picks it up
  - if it bumps into sand and has some, it finds a nearby empty space
    and drops its sand
** Principles of designing multi-agent systems
- agents not functions (i.e., independent acting entities)
- keep them small in size (not much knowledge)
- keep them small in time (forgetful)
- keep agents small in scope (look only locally, etc.)
- decentralized system control

* Day 23

** HCOMP 2014
- http://www.humancomputation.com/2014/
** In the news
- http://www.computerworld.com/s/article/9226851/Crowdsourcing_game_helps_diagnose_infectious_diseases

** Ant sorting
- wander randomly
- sense nearby objects and maintain a small queue of what has been
  seen
- if not carrying anything, and at an object, decide stochastically
  whether or not to pick it up
  - probability of picking it up decreases if this color has been seen
    recently
  - p = (K+ / (K+ + F))^2
    - F is the fraction of items in memory of same color
    - K+ is a constant
    - if F becomes small compared to K+, p trends up (certainty)
- if carrying something, drop according to:
  - p = (F / (K- + F))^2
  - if seen this color recently, more chance that you'll drop it
** Prisoner's dilemma
- if you screw over a nice person you win

- you and your partner committed a crime
  - you are both arrested
  - the cops don't have much on you
  - if you defect (rat out your partner), AND your partner stays
    silent, you get no jail time, partner gets 5 years
  - if you cooperate (stay silent), AND your partner cooperates, you
    both get 1 year
  - if you both defect, you both get three years

- what is your best option (if you don't communicate)
  - if you never see your partner again
  - always defect


| Y | P |  Y |  P |
|---+---+----+----|
| D | D | -3 | -3 |
| D | C |  0 | -5 |
| C | D | -5 |  0 |
| C | C | -1 | -1 |

* Day 24

