daily-notes.html
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Day 14</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1">Prolog unification</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>"unify" a query or goal with something from the source file

<ul class="org-ul">
<li><code>female(X)</code> needs to be unified with something in the file

<ul class="org-ul">
<li><code>female(pam)</code> looks like it might work.
</li>

<li>just make <code>X = pam</code>, now they are equivalent
</li>
</ul>
</li>

<li><code>parent(X, Y)</code> unifies with <code>parent(bob, ann)</code> if <code>X=bob</code> and <code>Y=ann</code>
</li>

<li><code>family(Id, person(FirstName, _, _, _, _), _, _)</code>
would unify with the first family fact if <code>Id=10392</code> and
<code>FirstName=tom</code>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">Day 22</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1">Planning</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li>Still a search problem
</li>

<li>Purpose: generate a list of actions that take you from starting
state to goal state
</li>

<li>Consider:

<ul class="org-ul">
<li>10 airports
</li>
<li>50 planes
</li>
<li>200 pieces of cargo
</li>
<li>All cargo starts at SFO, needs to be at JFK
</li>
<li>Planes have infinite capacity
</li>
<li>Actions:
<ul class="org-ul">
<li>load cargo into plane: <code>load(p, c)</code>
</li>
<li>fly to airport: <code>fly(p, a1, a2)</code>
</li>
<li>unload cargo: <code>unload(p, c)</code>
</li>
</ul>
</li>
<li>50*200*9*50 = 4.5million possible actions at the start
</li>
</ul>
</li>

<li>Solution:
<ul class="org-ul">
<li>represent states as partial configurations of the world
</li>
<li>search backwards from the goal
</li>
</ul>
</li>

<li id="literal">a singular fact with no fluents, e.g., <code>on(monkey, floor)</code>;
could have negation: <code>not(on(monkey, floor))</code>
</li>
</ul>
</div>

<div id="outline-container-sec-13-1-1" class="outline-4">
<h4 id="sec-13-1-1">Features of a planning problem</h4>
<div class="outline-text-4" id="text-13-1-1">
<dl class="org-dl">
<dt> Initial state </dt><dd>a conjunction of positive literals (no fluents),
e.g., <code>on(monkey, floor), at(monkey, 5, 2),
                     on(box, floor), at(box, 3, 0), on(bananas, box)</code>
</dd>

<dt> Actions </dt><dd>each action has a name, relevant variables (fluents),
preconditions, effects
<ul class="org-ul">
<li>preconditions can refer to the variables (fluents)
</li>
<li>effects have positive and negative parts
<ul class="org-ul">
<li>also called add-lists and delete-lists
</li>
<li>these can refer to the variables (fluents)
</li>
</ul>
</li>
<li>here is an example action:
</li>
</ul>
</dd>
</dl>
<pre class="example">
action: climb(A, X)
  preconditions: on(A, floor), near(A, X)
  effects:
    add: on(A, X)
    delete: on(A, floor)
</pre>

<dl class="org-dl">
<dt> Goal state criteria </dt><dd>conjunction of literals, no fluents, can
have positive and negative literals
<ul class="org-ul">
<li>e.g., <code>not(on(monkey, floor)), has(monkey, bananas), ...</code>
</li>
</ul>
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-13-1-2" class="outline-4">
<h4 id="sec-13-1-2">Typical assumptions</h4>
<div class="outline-text-4" id="text-13-1-2">
<ul class="org-ul">
<li>atomic time (every action is indivisible)
</li>
<li>no concurrent actions
</li>
<li>deterministic actions
</li>
<li>agent is the sole source of change (frame problem)
</li>
<li>agent is omniscient
</li>
<li>closed world assumption
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">Day 22</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1">Boids</h3>
<div class="outline-text-3" id="text-14-1">
<ul class="org-ul">
<li>"birds" &#x2013; flocking behavior
</li>
<li>each boid has these rules:
<ul class="org-ul">
<li>cohesion: try to approach other boids
</li>
<li>separation: try to keep a minimum distance
</li>
<li>imitation: try to move the same way as other boids
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2">Altruism model</h3>
<div class="outline-text-3" id="text-14-2">
<ul class="org-ul">
<li>each patch's calculation:
<ul class="org-ul">
<li>if patch is altruistic:
<ul class="org-ul">
<li>F = 1 + (# of altruists nearby / 5) * benefit-from-altruism -
cost-of-altruism
</li>
</ul>
</li>
<li>if patch is selfish:
<ul class="org-ul">
<li>F = 1 + (# of altruists nearby / 5) * benefit-from-altruism
</li>
</ul>
</li>
</ul>
</li>
<li>higher harshness: reduces the chance of a patch turning either
altruistic or selfish. Limits population growth.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-14-3" class="outline-3">
<h3 id="sec-14-3">Termite collecting</h3>
<div class="outline-text-3" id="text-14-3">
<ul class="org-ul">
<li>predesignated collection spot:
<ul class="org-ul">
<li>check: is all sand in the pile?
<ul class="org-ul">
<li>if not, do I have sand?
<ul class="org-ul">
<li>if yes, take it to pile, drop off
</li>
<li>else, pick up sand not in pile, then start over
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>use flocking behavior to group together,
<ul class="org-ul">
<li>if encounter sand, pick up along the way,
</li>
<li>drop off after flocking behavior is terminated
<ul class="org-ul">
<li>(all sand should be in nearly same spot)
</li>
</ul>
</li>
</ul>
</li>
<li>what actually happens:
<ul class="org-ul">
<li>each termite wanders randomly
</li>
<li>if it bumps into sand and has none in its mouth, it picks it up
</li>
<li>if it bumps into sand and has some, it finds a nearby empty space
and drops its sand
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-14-4" class="outline-3">
<h3 id="sec-14-4">Principles of designing multi-agent systems</h3>
<div class="outline-text-3" id="text-14-4">
<ul class="org-ul">
<li>agents not functions (i.e., independent acting entities)
</li>
<li>keep them small in size (not much knowledge)
</li>
<li>keep them small in time (forgetful)
</li>
<li>keep agents small in scope (look only locally, etc.)
</li>
<li>decentralized system control
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">Day 23</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1">HCOMP 2014</h3>
<div class="outline-text-3" id="text-15-1">
<ul class="org-ul">
<li><a href="http://www.humancomputation.com/2014/">http://www.humancomputation.com/2014/</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-15-2" class="outline-3">
<h3 id="sec-15-2">In the news</h3>
<div class="outline-text-3" id="text-15-2">
<ul class="org-ul">
<li><a href="http://www.computerworld.com/s/article/9226851/Crowdsourcing_game_helps_diagnose_infectious_diseases">http://www.computerworld.com/s/article/9226851/Crowdsourcing_game_helps_diagnose_infectious_diseases</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-15-3" class="outline-3">
<h3 id="sec-15-3">Ant sorting</h3>
<div class="outline-text-3" id="text-15-3">
<ul class="org-ul">
<li>wander randomly
</li>
<li>sense nearby objects and maintain a small queue of what has been
seen
</li>
<li>if not carrying anything, and at an object, decide stochastically
whether or not to pick it up
<ul class="org-ul">
<li>probability of picking it up decreases if this color has been seen
recently
</li>
<li>p = (K+ / (K+ + F))^2
<ul class="org-ul">
<li>F is the fraction of items in memory of same color
</li>
<li>K+ is a constant
</li>
<li>if F becomes small compared to K+, p trends up (certainty)
</li>
</ul>
</li>
</ul>
</li>
<li>if carrying something, drop according to:
<ul class="org-ul">
<li>p = (F / (K- + F))^2
</li>
<li>if seen this color recently, more chance that you'll drop it
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-15-4" class="outline-3">
<h3 id="sec-15-4">Prisoner's dilemma</h3>
<div class="outline-text-3" id="text-15-4">
<ul class="org-ul">
<li>if you screw over a nice person you win
</li>

<li>you and your partner committed a crime
<ul class="org-ul">
<li>you are both arrested
</li>
<li>the cops don't have much on you
</li>
<li>if you defect (rat out your partner), AND your partner stays
silent, you get no jail time, partner gets 5 years
</li>
<li>if you cooperate (stay silent), AND your partner cooperates, you
both get 1 year
</li>
<li>if you both defect, you both get three years
</li>
</ul>
</li>

<li>what is your best option (if you don't communicate)
<ul class="org-ul">
<li>if you never see your partner again
</li>
<li>always defect
</li>
</ul>
</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Y</th>
<th scope="col" class="left">P</th>
<th scope="col" class="right">Y</th>
<th scope="col" class="right">P</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">D</td>
<td class="left">D</td>
<td class="right">-3</td>
<td class="right">-3</td>
</tr>

<tr>
<td class="left">D</td>
<td class="left">C</td>
<td class="right">0</td>
<td class="right">-5</td>
</tr>

<tr>
<td class="left">C</td>
<td class="left">D</td>
<td class="right">-5</td>
<td class="right">0</td>
</tr>

<tr>
<td class="left">C</td>
<td class="left">C</td>
<td class="right">-1</td>
<td class="right">-1</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
