daily-notes.html
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">Day 24</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1">Machine learning</h3>
<div class="outline-text-3" id="text-16-1">
<ul class="org-ul">
<li><b>clustering</b>: grouping data, without really having a clue what the
right groups are
</li>
<li><b>classification</b>: take a single data point and predict its class
</li>

<li>why use clustering?
<ul class="org-ul">
<li>Wolfram Alpha, connect to facebook
</li>
<li>marketing: get an idea of demographics, are there distinct groups
of consumers
</li>
<li><b>exploratory analysis</b>
</li>
</ul>
</li>

<li>why use classification?
<ul class="org-ul">
<li>facebook tags faces automatically
</li>
<li>finding porn, and filtering it out
</li>
<li>detect copyrighted videos
</li>
<li>spam
</li>
<li>separating email by promotions, social, etc.
</li>
<li>xbox kinect detecting gameplay speaking vs. other speaking
<ul class="org-ul">
<li>and various motions
</li>
</ul>
</li>
<li>cheating analysis
</li>
</ul>
</li>

<li>with clustering, you don't have predefined groups (classes)
<ul class="org-ul">
<li>you also don't have the answers
</li>
</ul>
</li>
<li>with classification, you do
<ul class="org-ul">
<li>you also have some training set
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-16-2" class="outline-3">
<h3 id="sec-16-2">K-means clustering</h3>
<div class="outline-text-3" id="text-16-2">
<ul class="org-ul">
<li>groups data into clusters
</li>
<li>you have to decide k, i.e., how many clusters (decide <b>a priori</b>)
</li>
<li>"closest" &#x2013; Euclidean distance, Manhattan distance
<ul class="org-ul">
<li>each of these require that all dimensions are numeric
<ul class="org-ul">
<li>not all features are necessarily numeric
<ul class="org-ul">
<li>e.g., ethinicity, gender, country-of-residence, etc.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>the centroids live in the feature space
<ul class="org-ul">
<li>must be able to generate new centroids as averages of points
</li>
</ul>
</li>
<li>algorithm:
<ul class="org-ul">
<li>randomly select k centroids
</li>
<li>now loop:
<ul class="org-ul">
<li>for each point, determine the closest cluster
</li>
<li>recompute centroids as averages of points for each cluster
</li>
<li>repeat, until centroids don't change
</li>
</ul>
</li>
</ul>
</li>
<li>k-means assumes clusters have "spherical" distributions
<ul class="org-ul">
<li>actually, the partition of the space is not spherical,
it's a Voronoi diagram
<ul class="org-ul">
<li>every possible point is closest to some cluster (or equidistant)
</li>
<li>can ask about a new point, which cluster is it in?
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17">Day 25</h2>
<div class="outline-text-2" id="text-17">
<ul class="org-ul">
<li>k-nearest neighbor is a way to do classification (not clustering)
</li>

<li>scenario for classification:

<ul class="org-ul">
<li>you've got a lot of example points (with known classes)
</li>
<li>you've got a new example, with an unknown class
</li>
<li>what do you do?
<ul class="org-ul">
<li>figure out which point of which class is closest
<ul class="org-ul">
<li>according to, say, euclidean distance
</li>
</ul>
</li>
<li>or better, give each k closest points a "vote"
<ul class="org-ul">
<li>problems with large/small k:
<ul class="org-ul">
<li>if k is too small, noise has too great of an impact
</li>
<li>if k is too large, the dominant class has too large of an
impact
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>

<li>k-nearest neighbor algorithm:
<ul class="org-ul">
<li>for new point X, find k closest known points
</li>
<li>give each point a vote for that class
</li>
<li>X gets class of most votes
</li>
</ul>
</li>

<li>variations:
<ul class="org-ul">
<li>weigh the vote by closeness: closer points get bigger vote
<ul class="org-ul">
<li>vote is worth 1/distance(p, X)
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1">Classification evaluation</h3>
<div class="outline-text-3" id="text-17-1">
<ul class="org-ul">
<li>we have one dataset with known classes

<ul class="org-ul">
<li>let's split it into a training and testing set (say, 90/10%)
</li>
</ul>
</li>

<li>what are we interested in when we classify a set of points?

<ul class="org-ul">
<li>true positive (TP): the predicted class is the true class
</li>

<li>false positive (FP): the predicted class is false
</li>

<li>false negative (FN): failed to predict the true class
</li>

<li>precision: tp/(tp+fp) &#x2013; fraction of times it said "A class" and
got it right; in other words, fraction of responses about A class
that were correct
</li>

<li>recall: tp/(tp+fn) &#x2013; fraction of times it said "A class" over
number of things in A class; in other words, fraction of A class
things it correctly identified (recalled)
</li>

<li>these measures come from information retrieval (e.g., search
engines)

<ul class="org-ul">
<li>imagine searching for "machine learning"
</li>

<li>get high precision but lose on recall by doing:

<ul class="org-ul">
<li>it gives you just a couple good articles about ML, but misses
many
</li>
</ul>
</li>

<li>get high recall but lose on precision by doing:

<ul class="org-ul">
<li>give back the internet (surely it gets all the ML articles in
there)
</li>
</ul>
</li>
</ul>
</li>

<li>so we have two metrics (precision/recall) that somewhat compete
<ul class="org-ul">
<li>it's a tradeoff
</li>

<li>another metric: precision/recall
</li>

<li>another metric: the arithmetic average
</li>

<li>another metric: the harmonic average (F-score)
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18">Day 26</h2>
<div class="outline-text-2" id="text-18">
</div><div id="outline-container-sec-18-1" class="outline-3">
<h3 id="sec-18-1">Chinese room argument (Searle)</h3>
<div class="outline-text-3" id="text-18-1">
</div><div id="outline-container-sec-18-1-1" class="outline-4">
<h4 id="sec-18-1-1">Weak AI</h4>
<div class="outline-text-4" id="text-18-1-1">
<ul class="org-ul">
<li>Can help test psychological theories
</li>
<li>Not positing that the software is conscious or understands something
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-18-1-2" class="outline-4">
<h4 id="sec-18-1-2">Strong AI</h4>
<div class="outline-text-4" id="text-18-1-2">
<ul class="org-ul">
<li>The program is a mind
</li>
<li>It truly understands things
</li>
<li>Is the psychological theory
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-18-1-3" class="outline-4">
<h4 id="sec-18-1-3">Schank's scripts</h4>
<div class="outline-text-4" id="text-18-1-3">
<ul class="org-ul">
<li>Here's a story:
</li>
</ul>

<p>
A man went into a restaurant and ordered a hamburger. When the
hamburger arrived it was burned to a crisp, and the man stormed out of
the restaurant angrily, without paying for the hamburger or leaving a
tip.
</p>

<ul class="org-ul">
<li>Did the man eat the hamburger? No
</li>
</ul>

<p>
A man went into a restaurant and ordered a hamburger; when the
hamburger came he was very pleased with it; and as he left the
restaurant he gave the waitress a large tip before paying his bill."
</p>

<ul class="org-ul">
<li>Did the man eat the hamburger? Yes
</li>
</ul>
</div>

<div id="outline-container-sec-18-1-3-1" class="outline-5">
<h5 id="sec-18-1-3-1">Scripts</h5>
<div class="outline-text-5" id="text-18-1-3-1">
<p>
Are templates for stories; depending on the story, a certain template
is activated (e.g., the restaurant template), and can fill in missing
details.
</p>

<ul class="org-ul">
<li>If it answers correctly, consistently, we can say the software
understands what happened in the story.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-18-1-4" class="outline-4">
<h4 id="sec-18-1-4">Searle's counterargument</h4>
<div class="outline-text-4" id="text-18-1-4">
</div><div id="outline-container-sec-18-1-4-1" class="outline-5">
<h5 id="sec-18-1-4-1">The setup</h5>
<div class="outline-text-5" id="text-18-1-4-1">
<ul class="org-ul">
<li>The assumption: Searle does not understand Chinese
</li>
<li>Searle is stuck in a room
</li>
<li>Three books:
<ul class="org-ul">
<li>Book 1: Chinese symbols
</li>
<li>Book 2: Chinese symbols + English rules that utilize books 1 &amp; 2
</li>
<li>Book 3: Chinese symbols + English rules that utilize books 1 &amp; 2
</li>
</ul>
</li>
<li>What happens?
<ul class="org-ul">
<li>Searle gets a message from the outside, in Chinese
</li>
<li>He looks in books 1 &amp; 2 &amp; 3 and follows the English rules for
matching and correlating symbols, and spits out another Chinese
symbol
</li>
</ul>
</li>
<li>Clearly,
<ul class="org-ul">
<li>Searle is the computer
</li>
<li>The English rules are the program
</li>
<li>The books are the data
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-18-1-4-2" class="outline-5">
<h5 id="sec-18-1-4-2">What if I told you that:</h5>
<div class="outline-text-5" id="text-18-1-4-2">
<p>
Searle was responding correctly, in Chinese, to Chinese questions
about Chinese stories?
</p>
</div>
</div>
<div id="outline-container-sec-18-1-4-3" class="outline-5">
<h5 id="sec-18-1-4-3">Questions</h5>
<div class="outline-text-5" id="text-18-1-4-3">
<ul class="org-ul">
<li>Does Searle understand Chinese?
<ul class="org-ul">
<li>No
</li>
</ul>
</li>
<li>Does this program (the whole room) explain human understanding?
<ul class="org-ul">
<li>No, there is no understanding anywhere
</li>
</ul>
</li>
<li>What does Searle "have" in the case of English that he doesn't have
in the case of Chinese?
</li>
</ul>
</div>
</div>
